La-guajolota/STM32F411CEU-owo-STM32F746/NRF24L01/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define DIMmenos_Pin GPIO_PIN_3
#define DIMmenos_GPIO_Port GPIOA
#define DIMmenos_EXTI_IRQn EXTI3_IRQn
#define ONOFF_Pin GPIO_PIN_4
#define ONOFF_GPIO_Port GPIOA
#define ONOFF_EXTI_IRQn EXTI4_IRQn
#define MODE_Pin GPIO_PIN_5
#define MODE_GPIO_Port GPIOA
#define MODE_EXTI_IRQn EXTI9_5_IRQn
#define EFECTO_Pin GPIO_PIN_6
#define EFECTO_GPIO_Port GPIOA
#define EFECTO_EXTI_IRQn EXTI9_5_IRQn
#define DIMmas_Pin GPIO_PIN_7
#define DIMmas_GPIO_Port GPIOA
#define DIMmas_EXTI_IRQn EXTI9_5_IRQn
#define CS_Pin GPIO_PIN_12
#define CS_GPIO_Port GPIOB
#define EN_Pin GPIO_PIN_8
#define EN_GPIO_Port GPIOA
#define IRQ_Pin GPIO_PIN_9
#define IRQ_GPIO_Port GPIOA
#define IRQ_EXTI_IRQn EXTI9_5_IRQn

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
